garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="18xxxx" edc:clonedfrom="PIC18F16Q20" edc:desc="" edc:dosid="05204" edc:dsid="DS40002387" edc:hasfreeze="true" edc:informedby="DOS DS PS" edc:isextended="false" edc:masksetid="KV00W" edc:name="PIC18F15Q20" edc:procid="0xA34A" edc:psid="DS40002327" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power edc:hashighvoltagemclr2="true">
    <edc:VPP edc:defaultvoltage="9.000" edc:maxvoltage="9.000" edc:minvoltage="7.900"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="1.800" edc:minvoltage="1.800" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:erasepagesize="128" edc:haschecksum="false" edc:haslvp2="true" edc:hasrowerasecmd="true" edc:hasvppfirst="true" edc:lvpthresh="1.800" edc:memtech="ee" edc:pagesize="128" edc:panelsize="0x0" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="lverase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="75" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="75" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="eedata" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="userid" edc:time="75" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="rowerase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:addressablesize="256" edc:nzsize="256" edc:progop="rowerase" edc:sizeunits="bytes"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="eedata"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="userid"/>
    <edc:Wait edc:lverase="11000" edc:lvpgm="75" edc:erase="11000" edc:pgm="75" edc:cfg="11000" edc:eedata="11000" edc:userid="75" edc:rowerase="11000"/>
    <edc:Latches edc:rowerase="256" edc:pgm="1" edc:cfg="1" edc:eedata="1" edc:userid="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="64" edc:hwstackdepth="128">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0x000000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="cpu_pic18f_v6"/>
  <edc:Oscillator/>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="SW" edc:desc="Software Interrupt" edc:irq="0"/>
    <edc:Interrupt edc:cname="INT0" edc:desc="External Interrupt 0" edc:irq="1"/>
    <edc:Interrupt edc:cname="INT1" edc:desc="External Interrupt 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="INT2" edc:desc="External Interrupt 2" edc:irq="3"/>
    <edc:Interrupt edc:cname="DMA1SCNT" edc:desc="DMA1 Source Count Interrupt" edc:irq="4"/>
    <edc:Interrupt edc:cname="DMA1DCNT" edc:desc="DMA1 Destination Count Interrupt" edc:irq="5"/>
    <edc:Interrupt edc:cname="DMA1OR" edc:desc="DMA1 Overflow Interrupt" edc:irq="6"/>
    <edc:Interrupt edc:cname="DMA1A" edc:desc="DMA1 Abort Interrupt" edc:irq="7"/>
    <edc:Interrupt edc:cname="DMA2SCNT" edc:desc="DMA2 Source Count Interrupt" edc:irq="8"/>
    <edc:Interrupt edc:cname="DMA2DCNT" edc:desc="DMA2 Destination Count Interrupt" edc:irq="9"/>
    <edc:Interrupt edc:cname="DMA2OR" edc:desc="DMA2 Overflow Interrupt" edc:irq="10"/>
    <edc:Interrupt edc:cname="DMA2A" edc:desc="DMA2 Abort Interrupt" edc:irq="11"/>
    <edc:Interrupt edc:cname="DMA3SCNT" edc:desc="DMA3 Source Count Interrupt" edc:irq="12"/>
    <edc:Interrupt edc:cname="DMA3DCNT" edc:desc="DMA3 Destination Count Interrupt" edc:irq="13"/>
    <edc:Interrupt edc:cname="DMA3OR" edc:desc="DMA3 Overflow Interrupt" edc:irq="14"/>
    <edc:Interrupt edc:cname="DMA3A" edc:desc="DMA3 Abort Interrupt" edc:irq="15"/>
    <edc:Interrupt edc:cname="DMA4SCNT" edc:desc="DMA4 Source Count Interrupt" edc:irq="16"/>
    <edc:Interrupt edc:cname="DMA4DCNT" edc:desc="DMA4 Destination Count Interrupt" edc:irq="17"/>
    <edc:Interrupt edc:cname="DMA4OR" edc:desc="DMA4 Overflow Interrupt" edc:irq="18"/>
    <edc:Interrupt edc:cname="DMA4A" edc:desc="DMA4 Abort Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="NVM" edc:desc="NVM Interrupt" edc:irq="20"/>
    <edc:Interrupt edc:cname="CRC" edc:desc="CRC Interrupt" edc:irq="21"/>
    <edc:Interrupt edc:cname="SCAN" edc:desc="Scanner Interrupt" edc:irq="22"/>
    <edc:Interrupt edc:cname="ACT" edc:desc="Active Clock Tuning Interrupt" edc:irq="23"/>
    <edc:Interrupt edc:cname="CSW" edc:desc="Clock Switch Interrupt" edc:irq="24"/>
    <edc:Interrupt edc:cname="OSF" edc:desc="Oscillator Failure Interrupt" edc:irq="25"/>
    <edc:Interrupt edc:cname="VDDIO2" edc:desc="VDDIO2 Interrupt" edc:irq="26"/>
    <edc:Interrupt edc:cname="VDDIO3" edc:desc="VDDIO3 Interrupt" edc:irq="27"/>
    <edc:Interrupt edc:cname="IOC" edc:desc="Interrupt on Change" edc:irq="28"/>
    <edc:Interrupt edc:cname="TMR0" edc:desc="Timer0 Interrupt" edc:irq="29"/>
    <edc:Interrupt edc:cname="TMR1" edc:desc="Timer1 Interrupt" edc:irq="30"/>
    <edc:Interrupt edc:cname="TMR1G" edc:desc="Timer1 Gate Interrupt" edc:irq="31"/>
    <edc:Interrupt edc:cname="TMR2" edc:desc="Timer2 Interrupt" edc:irq="32"/>
    <edc:Interrupt edc:cname="TMR4" edc:desc="Timer4 Interrupt" edc:irq="33"/>
    <edc:Interrupt edc:cname="TU16A" edc:desc="16-Bit Universal Timer A Interrupt" edc:irq="34"/>
    <edc:Interrupt edc:cname="TU16B" edc:desc="16-Bit Universal Timer B Interrupt" edc:irq="35"/>
    <edc:Interrupt edc:cname="CCP1" edc:desc="CCP1 Interrupt" edc:irq="36"/>
    <edc:Interrupt edc:cname="CCP2" edc:desc="CCP2 Interrupt" edc:irq="37"/>
    <edc:Interrupt edc:cname="PWM1P" edc:desc="PWM1 Period Interrupt" edc:irq="38"/>
    <edc:Interrupt edc:cname="PWM1" edc:desc="PWM1 Interrupt" edc:irq="39"/>
    <edc:Interrupt edc:cname="PWM2P" edc:desc="PWM2 Period Interrupt" edc:irq="40"/>
    <edc:Interrupt edc:cname="PWM2" edc:desc="PWM2 Interrupt" edc:irq="41"/>
    <edc:Interrupt edc:cname="CWG1" edc:desc="CWG1 Interrupt" edc:irq="42"/>
    <edc:Interrupt edc:cname="CLC1" edc:desc="CLC1 Interrupt" edc:irq="43"/>
    <edc:Interrupt edc:cname="CLC2" edc:desc="CLC2 Interrupt" edc:irq="44"/>
    <edc:Interrupt edc:cname="CLC3" edc:desc="CLC3 Interrupt" edc:irq="45"/>
    <edc:Interrupt edc:cname="CLC4" edc:desc="CLC4 Interrupt" edc:irq="46"/>
    <edc:Interrupt edc:cname="IOCSR" edc:desc="Signal Routing Port Interrupt on Change" edc:irq="47"/>
    <edc:Interrupt edc:cname="U1RX" edc:desc="UART1 Receive Interrupt" edc:irq="48"/>
    <edc:Interrupt edc:cname="U1TX" edc:desc="UART1 Transmit Interrupt" edc:irq="49"/>
    <edc:Interrupt edc:cname="U1" edc:desc="UART1 Interrupt" edc:irq="50"/>
    <edc:Interrupt edc:cname="U1E" edc:desc="UART1 Error Interrupt" edc:irq="51"/>
    <edc:Interrupt edc:cname="U2RX" edc:desc="UART2 Receive Interrupt" edc:irq="52"/>
    <edc:Interrupt edc:cname="U2TX" edc:desc="UART2 Transmit Interrupt" edc:irq="53"/>
    <edc:Interrupt edc:cname="U2" edc:desc="UART2 Interrupt" edc:irq="54"/>
    <edc:Interrupt edc:cname="U2E" edc:desc="UART2 Error Interrupt" edc:irq="55"/>
    <edc:Interrupt edc:cname="SPI1RX" edc:desc="SPI1 Receive Interrupt" edc:irq="56"/>
    <edc:Interrupt edc:cname="SPI1TX" edc:desc="SPI1 Transmit Interrupt" edc:irq="57"/>
    <edc:Interrupt edc:cname="SPI1" edc:desc="SPI1 Interrupt" edc:irq="58"/>
    <edc:Interrupt edc:cname="I2C1RX" edc:desc="I2C1 Receive Interrupt" edc:irq="59"/>
    <edc:Interrupt edc:cname="I2C1TX" edc:desc="I2C1 Transmit Interrupt" edc:irq="60"/>
    <edc:Interrupt edc:cname="I2C1" edc:desc="I2C1 Interrupt" edc:irq="61"/>
    <edc:Interrupt edc:cname="I2C1E" edc:desc="I2C1 Error Interrupt" edc:irq="62"/>
    <edc:Interrupt edc:cname="I3C1RX" edc:desc="I3C1 Receive Interrupt" edc:irq="64"/>
    <edc:Interrupt edc:cname="I3C1TX" edc:desc="I3C1 Transmit Interrupt" edc:irq="65"/>
    <edc:Interrupt edc:cname="I3C1" edc:desc="I3C1 General Interrupt" edc:irq="66"/>
    <edc:Interrupt edc:cname="I3C1E" edc:desc="I3C1 Error Interrupt" edc:irq="67"/>
    <edc:Interrupt edc:cname="I3C1R" edc:desc="I3C1 Reset Interrupt" edc:irq="68"/>
    <edc:Interrupt edc:cname="I3C2RX" edc:desc="I3C2 Receive Interrupt" edc:irq="72"/>
    <edc:Interrupt edc:cname="I3C2TX" edc:desc="I3C2 Transmit Interrupt" edc:irq="73"/>
    <edc:Interrupt edc:cname="I3C2" edc:desc="I3C2 General Interrupt" edc:irq="74"/>
    <edc:Interrupt edc:cname="I3C2E" edc:desc="I3C2 Error Interrupt" edc:irq="75"/>
    <edc:Interrupt edc:cname="I3C2R" edc:desc="I3C2 Reset Interrupt" edc:irq="76"/>
    <edc:Interrupt edc:cname="HLVD" edc:desc="HLVD Interrupt" edc:irq="77"/>
    <edc:Interrupt edc:cname="AD" edc:desc="ADC Interrupt" edc:irq="78"/>
    <edc:Interrupt edc:cname="ADT" edc:desc="ADC Threshold Interrupt" edc:irq="79"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x3" edc:idbyte="r"/>
  <edc:Freeze edc:addr="0x0020">
    <edc:FreezeBit edc:freezeval="1" edc:pos="6"/>
  </edc:Freeze>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x008000" edc:regionid="page"/>
    <edc:VectorArea edc:nzsize="0x52" edc:regionid="ivt"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200100" edc:regionid="testmem1"/>
    <edc:TestZone edc:beginaddr="0x240000" edc:endaddr="0x240400" edc:regionid="testmem2"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200040" edc:regionid="idlocs"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x240004" edc:endaddr="0x240008" edc:regionid="debug"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x300018" edc:regionid="config">
      <edc:DCRDef edc:access="-nnn-nnn" edc:cname="CONFIG1" edc:desc="Configuration Byte 1" edc:factorydefault="0xff" edc:impl="0x77" edc:name="CONFIG1" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x77" edc:default="0xff" edc:_addr="0x300000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FEXTOSC" edc:desc="External Oscillator Selection" edc:mask="0x7" edc:name="FEXTOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="HS_8MHZ" edc:desc="HS (crystal oscillator) up to 8 MHz" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="HS_16MHZ" edc:desc="HS (crystal oscillator) up to 16 MHz" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HS_24MHZ" edc:desc="HS (crystal oscillator) up to 24 MHz" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HS_32MHZ" edc:desc="HS (crystal oscillator) up to 32 MHz" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator not enabled" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="ECL" edc:desc="EC (external clock) below 500 kHz" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="ECM" edc:desc="EC (external clock) for 500 kHz to 8 MHz" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="ECH" edc:desc="EC (external clock) above 8 MHz" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="RSTOSC" edc:desc="Reset Oscillator Selection" edc:mask="0x7" edc:name="RSTOSC" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="HFINTOSC_64MHZ" edc:desc="HFINTOSC with HFFRQ = 64 MHz and CDIV = 1:1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="RESERVED_1" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EXTOSC_4PLL" edc:desc="EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="RESERVED_2" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LFINTOSC" edc:desc="Low-Frequency Oscillator" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="HFINTOSC_1MHZ" edc:desc="HFINTOSC with HFFRQ = 4 MHz and CDIV = 4:1" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="EXTOSC" edc:desc="EXTOSC operating per FEXTOSC bits (device manufacturing default)" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
