garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="OSCSTAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OSCSTAT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x7D">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="OSCSTAT1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLR" edc:mask="0x1" edc:name="PLLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SFOR" edc:mask="0x1" edc:name="SFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADOR" edc:mask="0x1" edc:name="ADOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOR" edc:mask="0x1" edc:name="SOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFOR" edc:mask="0x1" edc:name="LFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MFOR" edc:mask="0x1" edc:name="MFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HFOR" edc:mask="0x1" edc:name="HFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTOR" edc:mask="0x1" edc:name="EXTOR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn-n" edc:cname="OSCEN" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-0" edc:name="OSCEN" edc:nzwidth="8" edc:por="000000-0" edc:_addr="0x7E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLEN" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADOEN" edc:mask="0x1" edc:name="ADOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFOEN" edc:mask="0x1" edc:name="LFOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MFOEN" edc:mask="0x1" edc:name="MFOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HFOEN" edc:mask="0x1" edc:name="HFOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTOEN" edc:mask="0x1" edc:name="EXTOEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="OSCTUNE" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="OSCTUNE" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x7F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN5" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OSCFRQ" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OSCFRQ" edc:nzwidth="8" edc:por="----0000" edc:_addr="0x80">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="OSCFREQ"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FRQ" edc:mask="0xf" edc:name="FRQ" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FRQ0" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRQ1" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRQ2" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRQ3" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--r-r-" edc:cname="ACTCON" edc:desc="" edc:impl="0xca" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0-0-" edc:name="ACTCON" edc:nzwidth="8" edc:por="00--0-0-" edc:_addr="0x81">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS" edc:mask="0x1" edc:name="ORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="UD" edc:mask="0x1" edc:name="UD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTORS" edc:mask="0x1" edc:name="ACTORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTLOCK" edc:mask="0x1" edc:name="ACTLOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ACTUD" edc:mask="0x1" edc:name="ACTUD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTEN" edc:mask="0x1" edc:name="ACTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
