garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2TXB" edc:desc="I3C TRANSMIT BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrnrrcc" edc:cname="I3C2STAT0" edc:desc="I3C STATUS REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10001000" edc:name="I3C2STAT0" edc:nzwidth="8" edc:por="10001000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xBA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RNW" edc:mask="0x3" edc:name="RNW" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXBF" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTDET" edc:mask="0x1" edc:name="RSTDET" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMD" edc:mask="0x3" edc:name="OPMD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="BFREE" edc:mask="0x1" edc:name="BFREE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------r" edc:cname="I3C2STAT1" edc:desc="I3C STATUS REGISTER 1" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="I3C2STAT1" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xBB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXFNE" edc:mask="0x1" edc:name="TXFNE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="I3C2BSTAT" edc:desc="I3C BUS STATUS REGISTER" edc:impl="0x67" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="I3C2BSTAT" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xBC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TE0ERR" edc:mask="0x1" edc:name="TE0ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE1ERR" edc:mask="0x1" edc:name="TE1ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE2ERR" edc:mask="0x1" edc:name="TE2ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE3ERR" edc:desc="Data/Address bit" edc:mask="0x1" edc:name="TE3ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TE4ERR" edc:desc="Read/Write Information bit" edc:mask="0x1" edc:name="TE4ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TE5ERR" edc:mask="0x1" edc:name="TE5ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE6ERR" edc:mask="0x1" edc:name="TE6ERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PIR0" edc:desc="I3C GENERAL INTERRUPT FLAG REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PIR0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xBD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCCIF" edc:mask="0x1" edc:name="SCCCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTFIF" edc:mask="0x1" edc:name="BTFIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DADRIF" edc:mask="0x1" edc:name="DADRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SADRIF" edc:mask="0x1" edc:name="SADRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CACKIF" edc:mask="0x1" edc:name="I2CACKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIF" edc:mask="0x1" edc:name="RSCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIF" edc:mask="0x1" edc:name="PCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCIF" edc:mask="0x1" edc:name="SCIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="I3C2PIR1" edc:desc="I3C GENERAL INTERRUPT FLAG REGISTER 1" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="I3C2PIR1" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xBE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IBIDONEIF" edc:mask="0x1" edc:name="IBIDONEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DACHIF" edc:mask="0x1" edc:name="DACHIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCOMPIF" edc:mask="0x1" edc:name="TCOMPIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2ERRIR0" edc:desc="I3C ERROR INTERRUPT FLAG REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2ERRIR0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xBF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCCCIF" edc:mask="0x1" edc:name="UCCCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIF" edc:mask="0x1" edc:name="BTOIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUSEIF" edc:mask="0x1" edc:name="BUSEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBIEIF" edc:mask="0x1" edc:name="IBIEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HJEIF" edc:mask="0x1" edc:name="HJEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIF" edc:mask="0x1" edc:name="RXOIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIF" edc:mask="0x1" edc:name="TXUIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CNACKIF" edc:mask="0x1" edc:name="I2CNACKIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C2ERRIR1" edc:desc="I3C ERROR INTERRUPT FLAG REGISTER 1" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C2ERRIR1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXREIF" edc:mask="0x1" edc:name="RXREIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWEIF" edc:mask="0x1" edc:name="TXWEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWLOEIF" edc:mask="0x1" edc:name="MWLOEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABEIF" edc:mask="0x1" edc:name="ABEIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PIE0" edc:desc="I3C GENERAL INTERRUPT ENABLE REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCCIE" edc:mask="0x1" edc:name="SCCCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTFIE" edc:mask="0x1" edc:name="BTFIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DADRIE" edc:mask="0x1" edc:name="DADRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SADRIE" edc:mask="0x1" edc:name="SADRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CACKIE" edc:mask="0x1" edc:name="I2CACKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIE" edc:mask="0x1" edc:name="RSCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCIE" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="I3C2PIE1" edc:desc="I3C GENERAL INTERRUPT ENABLE REGISTER 1" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="I3C2PIE1" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IBIDONEIE" edc:mask="0x1" edc:name="IBIDONEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DACHIE" edc:mask="0x1" edc:name="DACHIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCOMPIE" edc:mask="0x1" edc:name="TCOMPIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2ERRIE0" edc:desc="I3C ERROR INTERRUPT ENABLE REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2ERRIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCCCIE" edc:mask="0x1" edc:name="UCCCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIE" edc:mask="0x1" edc:name="BTOIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUSEIE" edc:mask="0x1" edc:name="BUSEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBIEIE" edc:mask="0x1" edc:name="IBIEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HJEIE" edc:mask="0x1" edc:name="HJEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIE" edc:mask="0x1" edc:name="RXOIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIE" edc:mask="0x1" edc:name="TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CNACKIE" edc:mask="0x1" edc:name="I2CNACKIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C2ERRIE1" edc:desc="I3C ERROR INTERRUPT ENABLE REGISTER 1" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C2ERRIE1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXREIE" edc:mask="0x1" edc:name="RXREIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWEIE" edc:mask="0x1" edc:name="TXWEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWLOEIE" edc:mask="0x1" edc:name="MWLOEIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABEIE" edc:mask="0x1" edc:name="ABEIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C2BIDL" edc:desc="I3C BUS IDLE CONDITION THRESHOLD REGISTER" edc:name="I3C2BIDL" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC5">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2BIDLL" edc:desc="I3C BUS IDLE CONDITION THRESHOLD LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2BIDLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC5">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BIDLL" edc:mask="0xff" edc:name="BIDLL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2BIDLH" edc:desc="I3C BUS IDLE CONDITION THRESHOLD HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2BIDLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC6">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BIDLH" edc:mask="0xff" edc:name="BIDLH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2BAVL" edc:desc="I3C BUS AVAILABLE CONDITION THRESHOLD REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2BAVL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BAVL" edc:mask="0xff" edc:name="BAVL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C2BTO" edc:desc="I3C BUS TIMEOUT THRESHOLD" edc:name="I3C2BTO" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC8">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2BTOL" edc:desc="I3C BUS TIMEOUT THRESHOLD LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2BTOL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC8">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BTOL" edc:mask="0xff" edc:name="BTOL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2BTOH" edc:desc="I3C BUS TIMEOUT THRESHOLD HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2BTOH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xC9">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BTOH" edc:mask="0xff" edc:name="BTOH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2IBIMDB" edc:desc="I3C IN-BAND INTERRUPT MANDATORY DATA BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2IBIMDB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xCA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIMDB" edc:mask="0xff" edc:name="IBIMDB" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IBIMDB_4_0" edc:mask="0x1f" edc:name="IBIMDB_4_0" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="IBIMDB_7_5" edc:mask="0x7" edc:name="IBIMDB_7_5" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2RETRY" edc:desc="I3C ARBITRATION REQUEST RETRY LIMIT REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2RETRY" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xCB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RETRY" edc:mask="0xff" edc:name="RETRY" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rn" edc:cname="I3C2FEAT" edc:desc="I3C FEATURES REGISTER" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="I3C2FEAT" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xCC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HJCAP" edc:mask="0x1" edc:name="HJCAP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HDRCAP" edc:mask="0x1" edc:name="HDRCAP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="I3C2SADR" edc:desc="I3C STATIC ADDRESS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="I3C2SADR" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SADR" edc:mask="0x7f" edc:name="SADR" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="I3C2DADR" edc:desc="I3C DYNAMIC ADDRESS REGISTER" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="I3C2DADR" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xCE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DADR" edc:mask="0x7f" edc:name="DADR" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C2EC" edc:desc="I3C EVENT COMMANDS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00001001" edc:name="I3C2EC" edc:nzwidth="8" edc:por="00001001" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xCF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIEN" edc:mask="0x1" edc:name="IBIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EC2" edc:mask="0x1" edc:name="EC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HJEN" edc:mask="0x1" edc:name="HJEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EC_7_4" edc:mask="0xf" edc:name="EC_7_4" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C2MWL" edc:desc="I3C MAXIMUM WRITE LENGTH" edc:name="I3C2MWL" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD0">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MWLL" edc:desc="I3C MAXIMUM WRITE LENGTH LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MWLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MWLL" edc:mask="0xff" edc:name="MWLL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
