garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="I2C1BTOC" edc:desc="I2C BUS TIMEOUT ISM REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="I2C1BTOC" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05832_i2c_8bit_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x1FA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BTOC" edc:mask="0x7" edc:name="BTOC" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2CBTOC" edc:mask="0x7" edc:name="I2CBTOC" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="BTOC0" edc:mask="0x1" edc:name="BTOC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOC1" edc:mask="0x1" edc:name="BTOC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOC2" edc:mask="0x1" edc:name="BTOC2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CBTOC0" edc:mask="0x1" edc:name="I2CBTOC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTOC1" edc:mask="0x1" edc:name="I2CBTOC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTOC2" edc:mask="0x1" edc:name="I2CBTOC2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x2" edc:beginaddr="0x0200" edc:endaddr="0x0300" edc:regionid="sfr2">
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x200"/>
        <edc:SFRDef edc:access="nrnn--nn" edc:cname="FVRCON" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu00--00" edc:name="FVRCON" edc:nzwidth="8" edc:por="xx00--00" edc:_modsrc="DOS-02541_amp_fvr_ts_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x201">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="Zero-Cross Detect Positive-going Edge Interrupt Enable" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Zero-Cross Detect Polarity bit" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Zero-Cross Detect Data Output" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Zero-Cross Detect Software Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rr--nn" edc:cname="HLVDCON0" edc:desc="" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-xx--00" edc:name="HLVDCON0" edc:nzwidth="8" edc:por="0-xx--00" edc:_modsrc="DOS-02611_lvd_ctrl_v6_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x202">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTL" edc:mask="0x1" edc:name="INTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTH" edc:mask="0x1" edc:name="INTH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:mask="0x1" edc:name="OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HLVDINTL" edc:mask="0x1" edc:name="HLVDINTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDINTH" edc:mask="0x1" edc:name="HLVDINTH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="HLVDRDY" edc:mask="0x1" edc:name="HLVDRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDOUT" edc:mask="0x1" edc:name="HLVDOUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDEN" edc:mask="0x1" edc:name="HLVDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="HLVDCON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="HLVDCON1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02611_lvd_ctrl_v6_xxK40_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x203">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEL" edc:mask="0xf" edc:name="SEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEL0" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL1" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL2" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL3" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="HLVDSEL0" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL1" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL2" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDSEL3" edc:mask="0x1" edc:name="HLVDSEL0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x11" edc:_addr="0x204"/>
        <edc:JoinedSFRDef edc:cname="ADLTH" edc:desc="" edc:name="ADLTH" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x215">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x215">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LTH" edc:desc="" edc:mask="0xff" edc:name="LTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH0" edc:desc="" edc:mask="0x1" edc:name="ADLTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH1" edc:desc="" edc:mask="0x1" edc:name="ADLTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH2" edc:desc="" edc:mask="0x1" edc:name="ADLTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH3" edc:desc="" edc:mask="0x1" edc:name="ADLTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH4" edc:desc="" edc:mask="0x1" edc:name="ADLTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH5" edc:desc="" edc:mask="0x1" edc:name="ADLTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH6" edc:desc="" edc:mask="0x1" edc:name="ADLTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH7" edc:desc="" edc:mask="0x1" edc:name="ADLTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADLTH" edc:mask="0xff" edc:name="ADLTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="LTH0" edc:mask="0x1" edc:name="LTH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH1" edc:mask="0x1" edc:name="LTH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH2" edc:mask="0x1" edc:name="LTH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH3" edc:mask="0x1" edc:name="LTH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH4" edc:mask="0x1" edc:name="LTH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH5" edc:mask="0x1" edc:name="LTH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH6" edc:mask="0x1" edc:name="LTH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH7" edc:mask="0x1" edc:name="LTH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x216">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LTH" edc:desc="" edc:mask="0xff" edc:name="LTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH8" edc:desc="" edc:mask="0x1" edc:name="ADLTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH9" edc:desc="" edc:mask="0x1" edc:name="ADLTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH10" edc:desc="" edc:mask="0x1" edc:name="ADLTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH11" edc:desc="" edc:mask="0x1" edc:name="ADLTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH12" edc:desc="" edc:mask="0x1" edc:name="ADLTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH13" edc:desc="" edc:mask="0x1" edc:name="ADLTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH14" edc:desc="" edc:mask="0x1" edc:name="ADLTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH15" edc:desc="" edc:mask="0x1" edc:name="ADLTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADLTH" edc:mask="0xff" edc:name="ADLTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="LTH8" edc:mask="0x1" edc:name="LTH8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH9" edc:mask="0x1" edc:name="LTH9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH10" edc:mask="0x1" edc:name="LTH10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH11" edc:mask="0x1" edc:name="LTH11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH12" edc:mask="0x1" edc:name="LTH12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH13" edc:mask="0x1" edc:name="LTH13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH14" edc:mask="0x1" edc:name="LTH14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH15" edc:mask="0x1" edc:name="LTH15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
