garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x31F"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x320"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x321"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x322"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x323"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x324"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x325"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB5PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x326">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB5PPS0" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS1" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS2" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS3" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS4" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB6PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x327">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB6PPS0" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS1" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS2" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS3" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS4" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB7PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x328">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB7PPS0" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS1" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS2" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS3" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS4" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC0PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x329">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0PPS0" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS1" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS2" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS3" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS4" edc:mask="0x1" edc:name="RC0PPS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC1PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x32A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1PPS0" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS1" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS2" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS3" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS4" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x32B"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC3PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x32C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC3PPS0" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS1" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS2" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS3" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS4" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC4PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x32D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC4PPS0" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS1" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS2" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS3" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS4" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC5PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x32E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC5PPS0" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS1" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS2" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS3" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS4" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC6PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x32F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC6PPS0" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS1" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS2" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS3" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6PPS4" edc:mask="0x1" edc:name="RC6PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC7PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x330">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC7PPS0" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS1" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS2" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS3" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7PPS4" edc:mask="0x1" edc:name="RC7PPS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x331"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x351">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="INT0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="INT0PPS" edc:nzwidth="8" edc:por="---00010" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x352">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0PPS" edc:mask="0x1f" edc:name="INT0PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT0PPS0" edc:mask="0x1" edc:name="INT0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS1" edc:mask="0x1" edc:name="INT0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS2" edc:mask="0x1" edc:name="INT0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS3" edc:mask="0x1" edc:name="INT0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS4" edc:mask="0x1" edc:name="INT0PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="INT1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="INT1PPS" edc:nzwidth="8" edc:por="---00100" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x353">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1PPS" edc:mask="0x1f" edc:name="INT1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT1PPS0" edc:mask="0x1" edc:name="INT1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS1" edc:mask="0x1" edc:name="INT1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS2" edc:mask="0x1" edc:name="INT1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS3" edc:mask="0x1" edc:name="INT1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS4" edc:mask="0x1" edc:name="INT1PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="INT2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="INT2PPS" edc:nzwidth="8" edc:por="---00101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x354">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2PPS" edc:mask="0x1f" edc:name="INT2PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2PPS0" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS1" edc:mask="0x1" edc:name="INT2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS2" edc:mask="0x1" edc:name="INT2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS3" edc:mask="0x1" edc:name="INT2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS4" edc:mask="0x1" edc:name="INT2PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="---00010" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x355">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:mask="0x1f" edc:name="T0CKIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS0" edc:mask="0x1" edc:name="T0CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS1" edc:mask="0x1" edc:name="T0CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS2" edc:mask="0x1" edc:name="T0CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS3" edc:mask="0x1" edc:name="T0CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS4" edc:mask="0x1" edc:name="T0CKIPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="---00101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x356">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:mask="0x1f" edc:name="T1CKIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS0" edc:mask="0x1" edc:name="T1CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS1" edc:mask="0x1" edc:name="T1CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS2" edc:mask="0x1" edc:name="T1CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS3" edc:mask="0x1" edc:name="T1CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS4" edc:mask="0x1" edc:name="T1CKIPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1GPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T1GPPS" edc:nzwidth="8" edc:por="---00100" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x357">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1GPPS" edc:mask="0x1f" edc:name="T1GPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1GPPS0" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS1" edc:mask="0x1" edc:name="T1GPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS2" edc:mask="0x1" edc:name="T1GPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS3" edc:mask="0x1" edc:name="T1GPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS4" edc:mask="0x1" edc:name="T1GPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x8" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x358"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T2INPPS" edc:nzwidth="8" edc:por="---00101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x19" edc:_addr="0x360">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2INPPS" edc:mask="0x1f" edc:name="T2INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2INPPS0" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS1" edc:mask="0x1" edc:name="T2INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS2" edc:mask="0x1" edc:name="T2INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS3" edc:mask="0x1" edc:name="T2INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS4" edc:mask="0x1" edc:name="T2INPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
