garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
        <edc:AdjustPoint edc:offset="0x3" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39A"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="---00010" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS" edc:mask="0x1f" edc:name="CLCIN0PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS0" edc:mask="0x1" edc:name="CLCIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS1" edc:mask="0x1" edc:name="CLCIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS2" edc:mask="0x1" edc:name="CLCIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS3" edc:mask="0x1" edc:name="CLCIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS4" edc:mask="0x1" edc:name="CLCIN0PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:mask="0x1f" edc:name="CLCIN1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS0" edc:mask="0x1" edc:name="CLCIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS1" edc:mask="0x1" edc:name="CLCIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS2" edc:mask="0x1" edc:name="CLCIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS3" edc:mask="0x1" edc:name="CLCIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS4" edc:mask="0x1" edc:name="CLCIN1PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="---01110" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x39F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:mask="0x1f" edc:name="CLCIN2PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS0" edc:mask="0x1" edc:name="CLCIN2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS1" edc:mask="0x1" edc:name="CLCIN2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS2" edc:mask="0x1" edc:name="CLCIN2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS3" edc:mask="0x1" edc:name="CLCIN2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS4" edc:mask="0x1" edc:name="CLCIN2PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="---01101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:mask="0x1f" edc:name="CLCIN3PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS0" edc:mask="0x1" edc:name="CLCIN3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS1" edc:mask="0x1" edc:name="CLCIN3PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS2" edc:mask="0x1" edc:name="CLCIN3PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS3" edc:mask="0x1" edc:name="CLCIN3PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS4" edc:mask="0x1" edc:name="CLCIN3PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U1CTSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U1CTSPPS" edc:nzwidth="8" edc:por="---01111" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1CTSPPS" edc:mask="0x1f" edc:name="U1CTSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1CTSPPS0" edc:mask="0x1" edc:name="U1CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS1" edc:mask="0x1" edc:name="U1CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS2" edc:mask="0x1" edc:name="U1CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS3" edc:mask="0x1" edc:name="U1CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS4" edc:mask="0x1" edc:name="U1CTSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U1RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U1RXPPS" edc:nzwidth="8" edc:por="---01101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXPPS" edc:mask="0x1f" edc:name="U1RXPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1RXPPS0" edc:mask="0x1" edc:name="U1RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS1" edc:mask="0x1" edc:name="U1RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS2" edc:mask="0x1" edc:name="U1RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS3" edc:mask="0x1" edc:name="U1RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS4" edc:mask="0x1" edc:name="U1RXPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U2CTSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U2CTSPPS" edc:nzwidth="8" edc:por="---10000" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2CTSPPS" edc:mask="0x1f" edc:name="U2CTSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2CTSPPS0" edc:mask="0x1" edc:name="U2CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS1" edc:mask="0x1" edc:name="U2CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS2" edc:mask="0x1" edc:name="U2CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS3" edc:mask="0x1" edc:name="U2CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS4" edc:mask="0x1" edc:name="U2CTSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="U2RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="U2RXPPS" edc:nzwidth="8" edc:por="---10001" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXPPS" edc:mask="0x1f" edc:name="U2RXPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2RXPPS0" edc:mask="0x1" edc:name="U2RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS1" edc:mask="0x1" edc:name="U2RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS2" edc:mask="0x1" edc:name="U2RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS3" edc:mask="0x1" edc:name="U2RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS4" edc:mask="0x1" edc:name="U2RXPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A5"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SPI1SCKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SPI1SCKPPS" edc:nzwidth="8" edc:por="---01110" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS" edc:mask="0x1f" edc:name="SPI1SCKPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS0" edc:mask="0x1" edc:name="SPI1SCKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS1" edc:mask="0x1" edc:name="SPI1SCKPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS2" edc:mask="0x1" edc:name="SPI1SCKPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS3" edc:mask="0x1" edc:name="SPI1SCKPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS4" edc:mask="0x1" edc:name="SPI1SCKPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SPI1SDIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SPI1SDIPPS" edc:nzwidth="8" edc:por="---01101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS" edc:mask="0x1f" edc:name="SPI1SDIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS0" edc:mask="0x1" edc:name="SPI1SDIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS1" edc:mask="0x1" edc:name="SPI1SDIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS2" edc:mask="0x1" edc:name="SPI1SDIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS3" edc:mask="0x1" edc:name="SPI1SDIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS4" edc:mask="0x1" edc:name="SPI1SDIPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SPI1SSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SPI1SSPPS" edc:nzwidth="8" edc:por="---10110" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS" edc:mask="0x1f" edc:name="SPI1SSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS0" edc:mask="0x1" edc:name="SPI1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS1" edc:mask="0x1" edc:name="SPI1SSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS2" edc:mask="0x1" edc:name="SPI1SSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS3" edc:mask="0x1" edc:name="SPI1SSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS4" edc:mask="0x1" edc:name="SPI1SSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AA"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="I2C1SCLPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="I2C1SCLPPS" edc:nzwidth="8" edc:por="---01110" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS" edc:mask="0x1f" edc:name="I2C1SCLPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS0" edc:mask="0x1" edc:name="I2C1SCLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS1" edc:mask="0x1" edc:name="I2C1SCLPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS2" edc:mask="0x1" edc:name="I2C1SCLPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS3" edc:mask="0x1" edc:name="I2C1SCLPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS4" edc:mask="0x1" edc:name="I2C1SCLPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
