garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x476">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSWIE" edc:mask="0x1" edc:name="CSWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIE" edc:mask="0x1" edc:name="OSFIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VDDIO2IE" edc:mask="0x1" edc:name="VDDIO2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VDDIO3IE" edc:mask="0x1" edc:name="VDDIO3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIE" edc:mask="0x1" edc:name="IOCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IE" edc:mask="0x1" edc:name="TMR0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x477">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IE" edc:mask="0x1" edc:name="TMR4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIE" edc:mask="0x1" edc:name="TU16AIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BIE" edc:mask="0x1" edc:name="TU16BIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IE" edc:mask="0x1" edc:name="CCP2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIE" edc:mask="0x1" edc:name="PWM1PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IE" edc:mask="0x1" edc:name="PWM1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u0000000" edc:name="PIE5" edc:nzwidth="8" edc:por="x0000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x478">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM2PIE" edc:mask="0x1" edc:name="PWM2PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IE" edc:mask="0x1" edc:name="PWM2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IE" edc:mask="0x1" edc:name="CWG1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IE" edc:mask="0x1" edc:name="CLC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IE" edc:mask="0x1" edc:name="CLC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3IE" edc:mask="0x1" edc:name="CLC3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4IE" edc:mask="0x1" edc:name="CLC4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCSRIE" edc:mask="0x1" edc:name="IOCSRIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="PIE6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x479">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIE" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIE" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IE" edc:mask="0x1" edc:name="U1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIE" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIE" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIE" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IE" edc:mask="0x1" edc:name="U2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIE" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="PIE7" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PIE7" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x47A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IE" edc:mask="0x1" edc:name="SPI1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1RXIE" edc:mask="0x1" edc:name="I2C1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIE" edc:mask="0x1" edc:name="I2C1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IE" edc:mask="0x1" edc:name="I2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIE" edc:mask="0x1" edc:name="I2C1EIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
