garyPenhook/PIC-Assembler/edc/PIC18F15Q20.PIC
        <edc:SFRDef edc:access="------rr" edc:cname="MVIOSTAT" edc:desc="MVIO STATUS REGISTER" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uu" edc:name="MVIOSTAT" edc:nzwidth="8" edc:por="------uu" edc:_modsrc="DOS-0xxxx_io_multiv_ctrl_pic_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4A6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VDDIO2RDY" edc:mask="0x1" edc:name="VDDIO2RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VDDIO3RDY" edc:mask="0x1" edc:name="VDDIO3RDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x31" edc:_addr="0x4A7"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="STATUS" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="STATUS" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_addr="0x4D8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="FSR2" edc:desc="" edc:name="FSR2" edc:nzwidth="0x10" edc:_addr="0x4D9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR2" edc:desc="" edc:mask="0x3fff" edc:name="FSR2" edc:nzwidth="14"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="FSR2L" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x4D9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2L" edc:desc="" edc:mask="0xff" edc:name="FSR2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSR2H" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--uuuuuu" edc:name="FSR2H" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x4DA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2H" edc:mask="0x3f" edc:name="FSR2H" edc:nzwidth="6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--------" edc:cname="PLUSW2" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="true" edc:mclr="--------" edc:name="PLUSW2" edc:nzwidth="0x8" edc:por="--------" edc:_addr="0x4DB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLUSW2" edc:desc="" edc:mask="0xff" edc:name="PLUSW2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------" edc:cname="PREINC2" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="true" edc:mclr="--------" edc:name="PREINC2" edc:nzwidth="0x8" edc:por="--------" edc:_addr="0x4DC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PREINC2" edc:desc="" edc:mask="0xff" edc:name="PREINC2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------" edc:cname="POSTDEC2" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="true" edc:mclr="--------" edc:name="POSTDEC2" edc:nzwidth="0x8" edc:por="--------" edc:_addr="0x4DD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POSTDEC2" edc:desc="" edc:mask="0xff" edc:name="POSTDEC2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------" edc:cname="POSTINC2" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="true" edc:mclr="--------" edc:name="POSTINC2" edc:nzwidth="0x8" edc:por="--------" edc:_addr="0x4DE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POSTINC2" edc:desc="" edc:mask="0xff" edc:name="POSTINC2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------" edc:cname="INDF2" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="false" edc:mclr="xxxxxxxx" edc:name="INDF2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x4DF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF2" edc:desc="" edc:mask="0xff" edc:name="INDF2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
